; domain
(define (domain parking)
 (:requirements :strips :typing :action-costs)
 (:types car curb)
 (:predicates 
    (at-curb ?car - car) 
    (at-curb-num ?car - car ?curb - curb)
    (behind-car ?car ?front-car - car)
    (car-clear ?car - car) 
    (curb-clear ?curb - curb)
 )

(:functions (total-cost) - number)

	(:action move-curb-to-curb
		:parameters (?car - car ?curbsrc ?curbdest - curb)
		:precondition (and 
			(car-clear ?car)
			(curb-clear ?curbdest)
			(at-curb-num ?car ?curbsrc)
		)
		:effect (and 
			(not (curb-clear ?curbdest))
			(curb-clear ?curbsrc)
			(at-curb-num ?car ?curbdest)
			(not (at-curb-num ?car ?curbsrc))
                        (increase (total-cost) 1)
		)
	)

	(:action move-curb-to-car
		:parameters (?car - car ?curbsrc - curb ?cardest - car)
		:precondition (and 
			(car-clear ?car)
			(car-clear ?cardest)
			(at-curb-num ?car ?curbsrc)
			(at-curb ?cardest) 
		)
		:effect (and 
			(not (car-clear ?cardest))
			(curb-clear ?curbsrc)
			(behind-car ?car ?cardest)
			(not (at-curb-num ?car ?curbsrc))
			(not (at-curb ?car))
                        (increase (total-cost) 1)
		)
	)

	(:action move-car-to-curb
		:parameters (?car - car ?carsrc - car ?curbdest - curb)
		:precondition (and 
			(car-clear ?car)
			(curb-clear ?curbdest)
			(behind-car ?car ?carsrc)
		)
		:effect (and 
			(not (curb-clear ?curbdest))
			(car-clear ?carsrc)
			(at-curb-num ?car ?curbdest)
			(not (behind-car ?car ?carsrc))
			(at-curb ?car)
                        (increase (total-cost) 1)
		)
	)

	(:action move-car-to-car
		:parameters (?car - car ?carsrc - car ?cardest - car)
		:precondition (and 
			(car-clear ?car)
			(car-clear ?cardest)
			(behind-car ?car ?carsrc)
			(at-curb ?cardest) 
		)
		:effect (and 
			(not (car-clear ?cardest))
			(car-clear ?carsrc)
			(behind-car ?car ?cardest)
			(not (behind-car ?car ?carsrc))
                        (increase (total-cost) 1)
		)
	)
)

; problem
(define   (problem parking)
  (:domain parking)
  (:objects
     car_00  car_01  car_02  car_03  car_04  car_05  car_06  car_07  car_08  car_09  car_10 - car
     curb_0 curb_1 curb_2 curb_3 curb_4 curb_5 curb_6 - curb
  )
  (:init
    (at-curb car_07)
    (at-curb-num car_07 curb_0)
    (behind-car car_09 car_07)
    (car-clear car_09)
    (at-curb car_06)
    (at-curb-num car_06 curb_1)
    (behind-car car_08 car_06)
    (car-clear car_08)
    (at-curb car_01)
    (at-curb-num car_01 curb_2)
    (behind-car car_04 car_01)
    (car-clear car_04)
    (at-curb car_10)
    (at-curb-num car_10 curb_3)
    (behind-car car_02 car_10)
    (car-clear car_02)
    (at-curb car_03)
    (at-curb-num car_03 curb_4)
    (behind-car car_00 car_03)
    (car-clear car_00)
    (at-curb car_05)
    (at-curb-num car_05 curb_5)
    (car-clear car_05)
    (curb-clear curb_6)
  )
  (:goal
    (and
      (at-curb-num car_00 curb_0)
      (behind-car car_07 car_00)
      (at-curb-num car_01 curb_1)
      (behind-car car_08 car_01)
      (at-curb-num car_02 curb_2)
      (behind-car car_09 car_02)
      (at-curb-num car_03 curb_3)
      (behind-car car_10 car_03)
      (at-curb-num car_04 curb_4)
      (at-curb-num car_05 curb_5)
      (at-curb-num car_06 curb_6)
    )
  )
)
; =========== INIT =========== 
;  curb_0: car_07 car_09 
;  curb_1: car_06 car_08 
;  curb_2: car_01 car_04 
;  curb_3: car_10 car_02 
;  curb_4: car_03 car_00 
;  curb_5: car_05 
;  curb_6: 
; ========== /INIT =========== 

; =========== GOAL =========== 
;  curb_0: car_00 car_07 
;  curb_1: car_01 car_08 
;  curb_2: car_02 car_09 
;  curb_3: car_03 car_10 
;  curb_4: car_04 
;  curb_5: car_05 
;  curb_6: car_06 
; =========== /GOAL ===========

; plan
1. (move-car-to-car car_08 car_06 car_05)
   deleted: (car-clear car_05) (behind-car car_08 car_06)
   added: (car-clear car_06) (behind-car car_08 car_05)
   goals met: 1 of 11
2. (move-curb-to-curb car_06 curb_1 curb_6)
   deleted: (curb-clear curb_6) (at-curb-num car_06 curb_1)
   added: (curb-clear curb_1) (at-curb-num car_06 curb_6)
   goals met: 2 of 11
3. (move-car-to-car car_04 car_01 car_06)
   deleted: (car-clear car_06) (behind-car car_04 car_01)
   added: (car-clear car_01) (behind-car car_04 car_06)
   goals met: 2 of 11
4. (move-curb-to-curb car_01 curb_2 curb_1)
   deleted: (curb-clear curb_1) (at-curb-num car_01 curb_2)
   added: (curb-clear curb_2) (at-curb-num car_01 curb_1)
   goals met: 3 of 11
5. (move-car-to-curb car_02 car_10 curb_2)
   deleted: (curb-clear curb_2) (behind-car car_02 car_10)
   added: (car-clear car_10) (at-curb-num car_02 curb_2) (at-curb car_02)
   goals met: 4 of 11
6. (move-car-to-car car_08 car_05 car_01)
   deleted: (car-clear car_01) (behind-car car_08 car_05)
   added: (car-clear car_05) (behind-car car_08 car_01)
   goals met: 5 of 11
7. (move-curb-to-car car_10 curb_3 car_05)
   deleted: (car-clear car_05) (at-curb-num car_10 curb_3) (at-curb car_10)
   added: (curb-clear curb_3) (behind-car car_10 car_05)
   goals met: 5 of 11
8. (move-car-to-car car_09 car_07 car_02)
   deleted: (car-clear car_02) (behind-car car_09 car_07)
   added: (car-clear car_07) (behind-car car_09 car_02)
   goals met: 6 of 11
9. (move-curb-to-curb car_07 curb_0 curb_3)
   deleted: (curb-clear curb_3) (at-curb-num car_07 curb_0)
   added: (curb-clear curb_0) (at-curb-num car_07 curb_3)
   goals met: 6 of 11
10. (move-car-to-curb car_00 car_03 curb_0)
   deleted: (curb-clear curb_0) (behind-car car_00 car_03)
   added: (car-clear car_03) (at-curb-num car_00 curb_0) (at-curb car_00)
   goals met: 7 of 11
11. (move-curb-to-car car_07 curb_3 car_00)
   deleted: (car-clear car_00) (at-curb-num car_07 curb_3) (at-curb car_07)
   added: (curb-clear curb_3) (behind-car car_07 car_00)
   goals met: 8 of 11
12. (move-curb-to-curb car_03 curb_4 curb_3)
   deleted: (curb-clear curb_3) (at-curb-num car_03 curb_4)
   added: (curb-clear curb_4) (at-curb-num car_03 curb_3)
   goals met: 9 of 11
13. (move-car-to-car car_10 car_05 car_03)
   deleted: (car-clear car_03) (behind-car car_10 car_05)
   added: (car-clear car_05) (behind-car car_10 car_03)
   goals met: 10 of 11
14. (move-car-to-curb car_04 car_06 curb_4)
   deleted: (curb-clear curb_4) (behind-car car_04 car_06)
   added: (car-clear car_06) (at-curb-num car_04 curb_4) (at-curb car_04)
   goals met: 11 of 11
